tests/rouse_profile/Allrun
#!/bin/sh

# Create the mesh
blockMesh

# create the intial time folder
cp -r 0_org 0

# Run pimpleFoam
suspensionFoam > log
#funkySetFields -time 0:
suspensionFoam -postProcess -func R -time 2000
