tests/rouse_profile/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         500;

deltaT          0.5e-3;

writeControl    adjustableRunTime;

//writeInterval   #eval "$endTime";
writeInterval   100;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable on;

adjustTimeStep  true;

maxCo           0.5;

maxAlphaCo      1;

maxDeltaT       1e0;

libs (
    "libWilcoxOmegaWallFunction.so"
     "libOpenFOAM.so"
     "libsimpleSwakFunctionObjects.so"
     "libswakFunctionObjects.so"
     );

functions
{
    wallShearStress
    {
        type         wallShearStress;
        libs         ("libfieldFunctionObjects.so");
        patch
        (
            walls
        );
        executeControl timeStep;
        writeControl   writeTime;
    }
}

// ************************************************************************* //
